## Plan for org_account/main
**❌ &nbsp; Terraform Format:** `failed`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**🧹 &nbsp; Format:** run `terraform fmt` to fix the following: 
```sh
iam.tf
```
```terraform
Plan: 24 to add, 0 to change, 0 to destroy
```

<details>
<summary>Show Summary</summary>

| CHANGE |                                              NAME                                               |
|--------|-------------------------------------------------------------------------------------------------|
| add    | `aws_iam_policy.ct_list_controls`                                                               |
|        | `aws_iam_role_policy_attachment.ct_list_controls`                                               |
|        | `module.AFT_SRC.aws_controltower_control.DETECT_CLOUDTRAIL_ENABLED_ON_MEMBER_ACCOUNTS`          |
|        | `module.DumpsterFire_SRC.aws_controltower_control.DETECT_CLOUDTRAIL_ENABLED_ON_MEMBER_ACCOUNTS` |
|        | `module.DumpsterFire_SRC.aws_controltower_control.ENCRYPTED_VOLUMES`                            |
|        | `module.DumpsterFire_SRC.aws_controltower_control.RDS_INSTANCE_PUBLIC_ACCESS_CHECK`             |
|        | `module.DumpsterFire_SRC.aws_controltower_control.RDS_SNAPSHOTS_PUBLIC_PROHIBITED`              |
|        | `module.DumpsterFire_SRC.aws_controltower_control.RDS_STORAGE_ENCRYPTED`                        |
|        | `module.DumpsterFire_SRC.aws_controltower_control.RESTRICTED_COMMON_PORTS`                      |
|        | `module.DumpsterFire_SRC.aws_controltower_control.RESTRICTED_SSH`                               |
|        | `module.DumpsterFire_SRC.aws_controltower_control.ROOT_ACCOUNT_MFA_ENABLED`                     |
|        | `module.DumpsterFire_SRC.aws_controltower_control.S3_BUCKET_PUBLIC_READ_PROHIBITED`             |
|        | `module.DumpsterFire_SRC.aws_controltower_control.S3_BUCKET_PUBLIC_WRITE_PROHIBITED`            |
|        | `module.SRETools_SRC.aws_controltower_control.DETECT_CLOUDTRAIL_ENABLED_ON_MEMBER_ACCOUNTS`     |
|        | `module.SRETools_SRC.aws_controltower_control.ENCRYPTED_VOLUMES`                                |
|        | `module.SRETools_SRC.aws_controltower_control.RDS_INSTANCE_PUBLIC_ACCESS_CHECK`                 |
|        | `module.SRETools_SRC.aws_controltower_control.RDS_SNAPSHOTS_PUBLIC_PROHIBITED`                  |
|        | `module.SRETools_SRC.aws_controltower_control.RDS_STORAGE_ENCRYPTED`                            |
|        | `module.SRETools_SRC.aws_controltower_control.RESTRICTED_COMMON_PORTS`                          |
|        | `module.SRETools_SRC.aws_controltower_control.RESTRICTED_SSH`                                   |
|        | `module.SRETools_SRC.aws_controltower_control.ROOT_ACCOUNT_MFA_ENABLED`                         |
|        | `module.SRETools_SRC.aws_controltower_control.S3_BUCKET_PUBLIC_READ_PROHIBITED`                 |
|        | `module.SRETools_SRC.aws_controltower_control.S3_BUCKET_PUBLIC_WRITE_PROHIBITED`                |
|        | `module.Sandbox_SRC.aws_controltower_control.RDS_STORAGE_ENCRYPTED`                             |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_iam_policy.ct_list_controls will be created
  + resource "aws_iam_policy" "ct_list_controls" {
      + arn         = (known after apply)
      + description = "List Control Tower Controls"
      + id          = (known after apply)
      + name        = "CDSListControlTowerControls"
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "controltower:ListEnabledControls"
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags_all    = (known after apply)
    }

  # aws_iam_role_policy_attachment.ct_list_controls will be created
  + resource "aws_iam_role_policy_attachment" "ct_list_controls" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "cds-aws-lz-plan"
    }

  # module.AFT_SRC.aws_controltower_control.DETECT_CLOUDTRAIL_ENABLED_ON_MEMBER_ACCOUNTS will be created
  + resource "aws_controltower_control" "DETECT_CLOUDTRAIL_ENABLED_ON_MEMBER_ACCOUNTS" {
      + control_identifier = "arn:aws:controltower:ca-central-1::control/AWS-GR_DETECT_CLOUDTRAIL_ENABLED_ON_MEMBER_ACCOUNTS"
      + id                 = (known after apply)
      + target_identifier  = "arn:aws:organizations::659087519042:ou/o-625no8z3dd/ou-5gsq-qrtdvlzw"
    }

  # module.DumpsterFire_SRC.aws_controltower_control.DETECT_CLOUDTRAIL_ENABLED_ON_MEMBER_ACCOUNTS will be created
  + resource "aws_controltower_control" "DETECT_CLOUDTRAIL_ENABLED_ON_MEMBER_ACCOUNTS" {
      + control_identifier = "arn:aws:controltower:ca-central-1::control/AWS-GR_DETECT_CLOUDTRAIL_ENABLED_ON_MEMBER_ACCOUNTS"
      + id                 = (known after apply)
      + target_identifier  = "arn:aws:organizations::659087519042:ou/o-625no8z3dd/ou-5gsq-1bfads2f"
    }

  # module.DumpsterFire_SRC.aws_controltower_control.ENCRYPTED_VOLUMES will be created
  + resource "aws_controltower_control" "ENCRYPTED_VOLUMES" {
      + control_identifier = "arn:aws:controltower:ca-central-1::control/AWS-GR_ENCRYPTED_VOLUMES"
      + id                 = (known after apply)
      + target_identifier  = "arn:aws:organizations::659087519042:ou/o-625no8z3dd/ou-5gsq-1bfads2f"
    }

  # module.DumpsterFire_SRC.aws_controltower_control.RDS_INSTANCE_PUBLIC_ACCESS_CHECK will be created
  + resource "aws_controltower_control" "RDS_INSTANCE_PUBLIC_ACCESS_CHECK" {
      + control_identifier = "arn:aws:controltower:ca-central-1::control/AWS-GR_RDS_INSTANCE_PUBLIC_ACCESS_CHECK"
      + id                 = (known after apply)
      + target_identifier  = "arn:aws:organizations::659087519042:ou/o-625no8z3dd/ou-5gsq-1bfads2f"
    }

  # module.DumpsterFire_SRC.aws_controltower_control.RDS_SNAPSHOTS_PUBLIC_PROHIBITED will be created
  + resource "aws_controltower_control" "RDS_SNAPSHOTS_PUBLIC_PROHIBITED" {
      + control_identifier = "arn:aws:controltower:ca-central-1::control/AWS-GR_RDS_SNAPSHOTS_PUBLIC_PROHIBITED"
      + id                 = (known after apply)
      + target_identifier  = "arn:aws:organizations::659087519042:ou/o-625no8z3dd/ou-5gsq-1bfads2f"
    }

  # module.DumpsterFire_SRC.aws_controltower_control.RDS_STORAGE_ENCRYPTED will be created
  + resource "aws_controltower_control" "RDS_STORAGE_ENCRYPTED" {
      + control_identifier = "arn:aws:controltower:ca-central-1::control/AWS-GR_RDS_STORAGE_ENCRYPTED"
      + id                 = (known after apply)
      + target_identifier  = "arn:aws:organizations::659087519042:ou/o-625no8z3dd/ou-5gsq-1bfads2f"
    }

  # module.DumpsterFire_SRC.aws_controltower_control.RESTRICTED_COMMON_PORTS will be created
  + resource "aws_controltower_control" "RESTRICTED_COMMON_PORTS" {
      + control_identifier = "arn:aws:controltower:ca-central-1::control/AWS-GR_RESTRICTED_COMMON_PORTS"
      + id                 = (known after apply)
      + target_identifier  = "arn:aws:organizations::659087519042:ou/o-625no8z3dd/ou-5gsq-1bfads2f"
    }

  # module.DumpsterFire_SRC.aws_controltower_control.RESTRICTED_SSH will be created
  + resource "aws_controltower_control" "RESTRICTED_SSH" {
      + control_identifier = "arn:aws:controltower:ca-central-1::control/AWS-GR_RESTRICTED_SSH"
      + id                 = (known after apply)
      + target_identifier  = "arn:aws:organizations::659087519042:ou/o-625no8z3dd/ou-5gsq-1bfads2f"
    }

  # module.DumpsterFire_SRC.aws_controltower_control.ROOT_ACCOUNT_MFA_ENABLED will be created
  + resource "aws_controltower_control" "ROOT_ACCOUNT_MFA_ENABLED" {
      + control_identifier = "arn:aws:controltower:ca-central-1::control/AWS-GR_ROOT_ACCOUNT_MFA_ENABLED"
      + id                 = (known after apply)
      + target_identifier  = "arn:aws:organizations::659087519042:ou/o-625no8z3dd/ou-5gsq-1bfads2f"
    }

  # module.DumpsterFire_SRC.aws_controltower_control.S3_BUCKET_PUBLIC_READ_PROHIBITED will be created
  + resource "aws_controltower_control" "S3_BUCKET_PUBLIC_READ_PROHIBITED" {
      + control_identifier = "arn:aws:controltower:ca-central-1::control/AWS-GR_S3_BUCKET_PUBLIC_READ_PROHIBITED"
      + id                 = (known after apply)
      + target_identifier  = "arn:aws:organizations::659087519042:ou/o-625no8z3dd/ou-5gsq-1bfads2f"
    }

  # module.DumpsterFire_SRC.aws_controltower_control.S3_BUCKET_PUBLIC_WRITE_PROHIBITED will be created
  + resource "aws_controltower_control" "S3_BUCKET_PUBLIC_WRITE_PROHIBITED" {
      + control_identifier = "arn:aws:controltower:ca-central-1::control/AWS-GR_S3_BUCKET_PUBLIC_WRITE_PROHIBITED"
      + id                 = (known after apply)
      + target_identifier  = "arn:aws:organizations::659087519042:ou/o-625no8z3dd/ou-5gsq-1bfads2f"
    }

  # module.SRETools_SRC.aws_controltower_control.DETECT_CLOUDTRAIL_ENABLED_ON_MEMBER_ACCOUNTS will be created
  + resource "aws_controltower_control" "DETECT_CLOUDTRAIL_ENABLED_ON_MEMBER_ACCOUNTS" {
      + control_identifier = "arn:aws:controltower:ca-central-1::control/AWS-GR_DETECT_CLOUDTRAIL_ENABLED_ON_MEMBER_ACCOUNTS"
      + id                 = (known after apply)
      + target_identifier  = "arn:aws:organizations::659087519042:ou/o-625no8z3dd/ou-5gsq-7zshn7gc"
    }

  # module.SRETools_SRC.aws_controltower_control.ENCRYPTED_VOLUMES will be created
  + resource "aws_controltower_control" "ENCRYPTED_VOLUMES" {
      + control_identifier = "arn:aws:controltower:ca-central-1::control/AWS-GR_ENCRYPTED_VOLUMES"
      + id                 = (known after apply)
      + target_identifier  = "arn:aws:organizations::659087519042:ou/o-625no8z3dd/ou-5gsq-7zshn7gc"
    }

  # module.SRETools_SRC.aws_controltower_control.RDS_INSTANCE_PUBLIC_ACCESS_CHECK will be created
  + resource "aws_controltower_control" "RDS_INSTANCE_PUBLIC_ACCESS_CHECK" {
      + control_identifier = "arn:aws:controltower:ca-central-1::control/AWS-GR_RDS_INSTANCE_PUBLIC_ACCESS_CHECK"
      + id                 = (known after apply)
      + target_identifier  = "arn:aws:organizations::659087519042:ou/o-625no8z3dd/ou-5gsq-7zshn7gc"
    }

  # module.SRETools_SRC.aws_controltower_control.RDS_SNAPSHOTS_PUBLIC_PROHIBITED will be created
  + resource "aws_controltower_control" "RDS_SNAPSHOTS_PUBLIC_PROHIBITED" {
      + control_identifier = "arn:aws:controltower:ca-central-1::control/AWS-GR_RDS_SNAPSHOTS_PUBLIC_PROHIBITED"
      + id                 = (known after apply)
      + target_identifier  = "arn:aws:organizations::659087519042:ou/o-625no8z3dd/ou-5gsq-7zshn7gc"
    }

  # module.SRETools_SRC.aws_controltower_control.RDS_STORAGE_ENCRYPTED will be created
  + resource "aws_controltower_control" "RDS_STORAGE_ENCRYPTED" {
      + control_identifier = "arn:aws:controltower:ca-central-1::control/AWS-GR_RDS_STORAGE_ENCRYPTED"
      + id                 = (known after apply)
      + target_identifier  = "arn:aws:organizations::659087519042:ou/o-625no8z3dd/ou-5gsq-7zshn7gc"
    }

  # module.SRETools_SRC.aws_controltower_control.RESTRICTED_COMMON_PORTS will be created
  + resource "aws_controltower_control" "RESTRICTED_COMMON_PORTS" {
      + control_identifier = "arn:aws:controltower:ca-central-1::control/AWS-GR_RESTRICTED_COMMON_PORTS"
      + id                 = (known after apply)
      + target_identifier  = "arn:aws:organizations::659087519042:ou/o-625no8z3dd/ou-5gsq-7zshn7gc"
    }

  # module.SRETools_SRC.aws_controltower_control.RESTRICTED_SSH will be created
  + resource "aws_controltower_control" "RESTRICTED_SSH" {
      + control_identifier = "arn:aws:controltower:ca-central-1::control/AWS-GR_RESTRICTED_SSH"
      + id                 = (known after apply)
      + target_identifier  = "arn:aws:organizations::659087519042:ou/o-625no8z3dd/ou-5gsq-7zshn7gc"
    }

  # module.SRETools_SRC.aws_controltower_control.ROOT_ACCOUNT_MFA_ENABLED will be created
  + resource "aws_controltower_control" "ROOT_ACCOUNT_MFA_ENABLED" {
      + control_identifier = "arn:aws:controltower:ca-central-1::control/AWS-GR_ROOT_ACCOUNT_MFA_ENABLED"
      + id                 = (known after apply)
      + target_identifier  = "arn:aws:organizations::659087519042:ou/o-625no8z3dd/ou-5gsq-7zshn7gc"
    }

  # module.SRETools_SRC.aws_controltower_control.S3_BUCKET_PUBLIC_READ_PROHIBITED will be created
  + resource "aws_controltower_control" "S3_BUCKET_PUBLIC_READ_PROHIBITED" {
      + control_identifier = "arn:aws:controltower:ca-central-1::control/AWS-GR_S3_BUCKET_PUBLIC_READ_PROHIBITED"
      + id                 = (known after apply)
      + target_identifier  = "arn:aws:organizations::659087519042:ou/o-625no8z3dd/ou-5gsq-7zshn7gc"
    }

  # module.SRETools_SRC.aws_controltower_control.S3_BUCKET_PUBLIC_WRITE_PROHIBITED will be created
  + resource "aws_controltower_control" "S3_BUCKET_PUBLIC_WRITE_PROHIBITED" {
      + control_identifier = "arn:aws:controltower:ca-central-1::control/AWS-GR_S3_BUCKET_PUBLIC_WRITE_PROHIBITED"
      + id                 = (known after apply)
      + target_identifier  = "arn:aws:organizations::659087519042:ou/o-625no8z3dd/ou-5gsq-7zshn7gc"
    }

  # module.Sandbox_SRC.aws_controltower_control.RDS_STORAGE_ENCRYPTED will be created
  + resource "aws_controltower_control" "RDS_STORAGE_ENCRYPTED" {
      + control_identifier = "arn:aws:controltower:ca-central-1::control/AWS-GR_RDS_STORAGE_ENCRYPTED"
      + id                 = (known after apply)
      + target_identifier  = "arn:aws:organizations::659087519042:ou/o-625no8z3dd/ou-5gsq-qhvjdryl"
    }

Plan: 24 to add, 0 to change, 0 to destroy.

Warning: Argument is deprecated

  with module.publishing_bucket.aws_s3_bucket.this,
  on .terraform/modules/publishing_bucket/S3/main.tf line 8, in resource "aws_s3_bucket" "this":
   8: resource "aws_s3_bucket" "this" {

Use the aws_s3_bucket_logging resource instead

(and 9 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_event_rule.cds_sentinel_securityhub_rule"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.ct_list_controls"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.azure_sentinel"]
WARN - plan.json - main - Missing Common Tags: ["aws_kms_key.cds_sentinel_guard_duty_key"]
WARN - plan.json - main - Missing Common Tags: ["aws_organizations_organizational_unit.AFT"]
WARN - plan.json - main - Missing Common Tags: ["aws_organizations_organizational_unit.DumpsterFire"]
WARN - plan.json - main - Missing Common Tags: ["aws_organizations_organizational_unit.Production"]
WARN - plan.json - main - Missing Common Tags: ["aws_organizations_organizational_unit.SRETools"]
WARN - plan.json - main - Missing Common Tags: ["aws_organizations_organizational_unit.Sandbox"]
WARN - plan.json - main - Missing Common Tags: ["aws_organizations_organizational_unit.Security"]
WARN - plan.json - main - Missing Common Tags: ["aws_organizations_organizational_unit.Staging"]
WARN - plan.json - main - Missing Common Tags: ["aws_organizations_organizational_unit.Test"]
WARN - plan.json - main - Missing Common Tags: ["aws_organizations_policy.cds_snc_universal_guardrails"]
WARN - plan.json - main - Missing Common Tags: ["aws_sns_topic.critical"]
WARN - plan.json - main - Missing Common Tags: ["aws_sns_topic.warning"]
WARN - plan.json - main - Missing Common Tags: ["aws_sqs_queue.cloudtrail_sqs_queue"]
WARN - plan.json - main - Missing Common Tags: ["module.alarm_actions.aws_cloudwatch_metric_alarm.alarm_failure[\"Ops1\"]"]
WARN - plan.json - main - Missing Common Tags: ["module.alarm_actions.aws_cloudwatch_metric_alarm.alarm_failure[\"Ops2\"]"]
WARN - plan.json - main - Missing Common Tags: ["module.alarm_actions.aws_cloudwatch_metric_alarm.alarm_success[\"Ops1\"]"]
WARN - plan.json - main - Missing Common Tags: ["module.alarm_actions.aws_cloudwatch_metric_alarm.alarm_success[\"Ops2\"]"]
WARN - plan.json - main -...
```

</details>
